<template>
	<el-tabs v-model="activeName" @tab-click="handleClick">
		<el-tab-pane label="申请阶段" name="first">
			一、自愿提出入党申请
			要求入党的同志自愿向所在单位党支部提出书面申请，申请主要写对党的认识、入党动机和本人主要表现。党组织接到申请后，应派人与申请入党人谈话（一般在15天内）进行教育和鼓励。主要形式有：

			1、本人自愿，直接向党支部提交入党申请，也可以由党小组向党支部推荐；

			2、团组织推优；团员入党通常是由团组织推荐。
			确定入党积极分子

			二、确定入党积极分子

			经党支部委员会（不设委员的由支部党员大会）讨论决定，将符合条件的入党申请人按照坚持标准、保证质量的要求，确定为入党积极分子。
		</el-tab-pane>
		<el-tab-pane label="积极分子" name="first">
			一、指派培养联系人

			对入党积极分子，党支部要指定专人作培养联系人，并负责对其进行考核写实工作。入党积极分子的培养联系人，应当由经过一定时间党内生活的锻炼，能够用党员标准严格要求自己，先锋模范作用发挥得比较好的正式党员担任。培养联系人的主要任务是：

			1、经常了解入党积极分子的思想、工作、学习等情况和存在的问题，鼓励和帮助他们发扬优点，克服缺点，积极上进，端正入党动机。

			2、经常向党小组、党支部汇报入党积极分子的有关情况，提出加强培养、教育入党积极分子的意见和建议。

			3、在入党积极分子基本具备党员条件时，向党小组、党支部提出将其列为发展对象的建议。

			二、建立申请人档案

			党支部指定培养联系人为其填写《入党积极分子培养考察登记表》，交党支部统一保存，并上报集团组织部门备案。
			三、开展教育和考察

			党组织对要求入党的积极分子进行马克思列宁主义、毛泽东思想、邓小平理论和“三个代表”重要思想等基本理论知识的教育和党的基本路线的教育，以及党的优良传统和作风的教育，使他们懂得党的性质、纲领、指导思想、宗旨、任务、组织原则和纪律，懂得党员的义务和权利，帮助他们端正入党动机，确立为共产主义事业奋斗终身的信念。

			为了全面掌握积极分子的表现情况，党支部每半年对要求入党的积极分子进行一次考察，考察材料一般包括：积极分子的思想汇报；联系人写的积极分子表现情况；党组织定期对他们的分析意见等。

			四、对入党积极分子培养时间要求

			要求入党积极分子必须经过1年以上时间的培养考察。
		</el-tab-pane>
		<el-tab-pane label="发展对象" name="second">
			一、确定培养联系人

			为了使党组织更好地了解申请入党人的情况，加强对他们的教育、培养和考察。党章规定，发展党员必须有两名正式党员做介绍人。这对于保证党员质量，有着重要作用。入党介绍人一般由联系人担任，也可以由党组织指定其他党员担任。

			二、填写《入党志愿书》

			1、填写《入党志愿书》前，党支部负责人和入党介绍人应对入党申请人进行党的基本知识和对党忠诚的教育，将填写《入党志愿书》的目的和意义、填写内容和要求作详细说明。发展对象填写《入党志愿书》要严肃认真，忠诚老实。

			2、凡有一定文化程度的人，都要自己填写有关栏目。如本人填写确有困难，可由党支部指定党员按照发展对象口述代为填写。

			3、字迹要工整清楚。

			4、应当向党组织交代或说明的有些情况，没有填写栏目的，应另附纸说明。

			三、对发展对象进行政治审查

			1、主要内容：对党的路线、方针、政策的态度；本人的政治表现；直系亲属和与本人关系密切的主要社会关系的政治情况。

			2、基本方法：同本人谈话、查阅有关档案材料、找有关单位和人员了解，以及必要的函调或外调。在听取本人介绍和查阅有关材料后，情况清楚的可不再函调或外调。

			政治审查要形成综合性的政审材料。凡没有经过政治审查的，不能发展入党。

			四、对发展对象进行短期集中培训

			组织发展对象，集中到市直有关部门进行入党积极分子短期培训，时间一般为5-7天（或不少于40个学时），主要学习《中国共产党章程》、《关于党内政治生活的若干准则》等文件。

			没有经过培训的，除个别特殊情况外，不能发展入党。
		</el-tab-pane>
		<el-tab-pane label="预备党员" name="third">
			一、接收预备党员公示

			党支部将发展对象的主要情况，在召开支部大会前15天前，采取张榜公布的形式进行公示，公示时间为10天。基层党组织将党员、群众反映的情况，及时组织人员进行审核、调查，并在5天内形成审理意见，向支委会、支部大会通报，作为被反映对象能否成为预备党员的重要依据。

			二、支部委员会在支部大会讨论前的准备工作

			支委会在支部大会讨论发展对象的入党问题之前，一般要做好以下工作：

			1、广泛征求党内外有关群众对发展对象的意见。

			2、由支部负责同志或组织委员同发展对象谈话，进一步了解他对党的认识、入党动机以及其他需要了解的情况。

			3、召开支委会，听取入党介绍人关于发展对象的情况汇报，对发展对象填写的入党志愿书和有关问题进行审查。

			4、经支委会讨论，确认发展对象具备入党条件，手续完备后，决定提交支部大会进行讨论。

			三、召开支部大会

			召开支部大会讨论发展对象的入党问题。支部大会接收预备党员的主要程序是：

			1、发展对象汇报自己对党的认识、入党动机、本人履历、现实表现、家庭和主要社会关系情况，以及需向党组织说明的有关问题。

			2、入党介绍人介绍发展对象的主要情况，并对其能否入党表明意见。

			3、支委会向支部大会报告对发展对象审查的情况及其征求党内外群众意见的情况。

			4、与会党员发表意见，对发展对象能否入党进行讨论。

			5、发展对象对支部大会讨论的情况表明自己的态度。

			6、采取无记名投票的方式进行表决。赞成人数超过应到会有表决权的党员的半数，即可作出同意接收发展对象为预备党员的决议。

			支部大会讨论接收预备党员进行表决时，发展对象不必回避。有的同志担心发展对象在场会影响表决，或者本人不能正确对待。实践证明，只要做好工作，党内生活正常，这种担心是不必要的。如果发展对象不能正确对待不同意见或别人对自己的批评，党组织应对其进行教育、帮助。

			四、上级党组织派人谈话

			党章规定：“上级党组织在批准申请人人党以前，要派人同他谈话，作进一步的了解，并帮助他提高对党的认识。”这是发展党员工作中的一项重要程序。

			谈话时间放在支部大会讨论通过发展对象为预备党员之后，上级党组织审批之前这段时间来进行。
			五、上级党组织审批

			党委审批预备党员，必须集体讨论，表决决定。党委对党支部上报的接收预备党员的决议，必须在3个月内审批。如遇特殊情况可适当延长审批时间，但不得超过6个月。凡无故超过规定时间而未予审批的，应追究有关人员的责任。
		</el-tab-pane>
		<el-tab-pane label="党员转正" name="fourth">
			预备党员预备期满后，党支部应按时讨论其能否转为正式党员。具备党员条件的，按期转正；不完全具备条件、需进一步教育和考察的，可延长预备期，延长时间不能少于半年，最长不超过1年；不具备党员条件的；应取消其预备党员资格。

			按期转正，延长预备期，取消预备党员资格，都必须经支部大会讨论通过并报上级党委批准。

			一、预备党员提出转正申请

			预备党员预备期满，应主动向所在党组织提出转正式党员的书面申请。凡是自己能写的，应该主动手写；自己确实不能写的，可以口述，请人代写，但要有本人签名或盖章。

			预备党员在转正申请中，应当通过回顾总结在预备期间的表现，对照党员标准检查自己，肯定成绩和进步，找出差距和今后的努力方向，表明自己的决心。对于入党时应向而未向组织说明的问题，应当在转正申请中写清楚。转正申请要求实事求是，不能为了按期转正则文过饰非，掩盖缺点和不足。

			二、党支部征求党内外群众意见

			党支部要广泛征求党内外群众意见，并进行预备党员转正公示，公示时间一般为7天，程序与接收预备党员同。

			三、党小组讨论

			预备党员所在党小组进行讨论，提出对预备党员能否按期转正的意见。

			四、支部委员会审查

			支部委员会综合分析该预备党员能否按期转正，形成意见，准备提交支部大会讨论。

			五、支部大会讨论

			按照党章规定，预备党员转正必须经过支部大会讨论通过。主要程序是：

			1、申请转正的预备党员汇报自己在预备期间的表现，肯定成绩和进步，找出缺点和不足，表明自己的态度和决心，向党组织说明有关问题；

			2、党小组介绍预备党员在预备期间的表现情况和小组意见；

			3、支委会介绍对预备党员在预备期间的教育和考察情况，提出能否转为正式党员的意见；

			4、支部大会进行讨论，与会同志充分发表意见，并以无记名投票的方式进行表决，做出决议。

			申请转正的预备党员可以对支部大会讨论的意见或表决结果明确态度。

			注：（除特殊情况外，预备党员预备期未满，不能提前在支部大会讨论转正事宜）

			六、上报党委审批

			支部大会结束后，将支部大会决议填入《入党志愿书》，报上级党组织审批。党委审批前，派人进行谈话，作进一步的了解。党委审批后，党支部书记或支部委员要与本人谈话，并将审批结果在党员大会上宣布。党龄从预备党员转为正式党员之日算起。预备党员转正后，应将其《入党志愿书》、入党和转正申请书、自传、政审材料、教育考察等材料存入人事档案。
		</el-tab-pane>
	</el-tabs>
</template>


<script>
	export default {
		name: 'request',
		data() {
			return {
				activeName: 'second'
			};
		},
		methods: {
			handleClick(tab, event) {
				console.log(tab, event);
			}
		}
	};
</script>


<style>

</style>
